IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_gcrc_regs.xml
<module id="GCRC_REGS" HW_revision="" description="GCRC Registers">
	<register id="CRCCTRL" width="32" page="1" offset="0x0" internal="0" description="CRC Control Register">
		<bitfield id="POLYSIZE" description="CRC polynomial order" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="ENDIANNESS" description="Defines the endianness of the data stream." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="BITREVERSE" description="Enables the DATAIN bus to the CRC engine to be bit reversed." begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DATATYPE" description="Defines the DATATYPE of the element of the data array." begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="CRCPOLY" width="32" page="1" offset="0x4" internal="0" description="CRC Polynomial Register">
		<bitfield id="POLY" description="CRC polynomial" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRCDATAMASK" width="32" page="1" offset="0x8" internal="0" description="CRC Data Mask Register">
		<bitfield id="DATAMASK" description="Number of bits to be masked" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="CRCDATAIN" width="32" page="1" offset="0xc" internal="0" description="CRC Data Input Register">
		<bitfield id="DATAIN" description="CRC data input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRCDATAOUT" width="32" page="1" offset="0x10" internal="0" description="CRC Data Output Register">
		<bitfield id="DATA" description="CRC DATAOUT" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CRCDATATRANS" width="32" page="1" offset="0x14" internal="0" description="CRC Transformed Data Register">
		<bitfield id="DATAIN" description="Transformed data" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
